{
    "CR000001": "### Solution Document\n#### Document Header\n* **Organization:** State Bank of India\n* **Document Title:** Solution Document for Personalized Pink Coloured Chequebook for Female Corporate Salary Package Customers\n* **CR Number:** Information not provided in source documents.\n* **Date:** 28 February 2026\n* **Version:** 1.0\n\n#### Module Information\n* **Module:** NDVP (New Demand Validation Process)\n* **Functionality:** Issuance of Personalized Pink Coloured Chequebook to Female Corporate Salary Package Customers\n* **Brief Description:** The module aims to implement system-level validations in the Core Banking System (CBS) to enable the automatic issuance of pink coloured chequebooks to female customers holding Corporate Salary Package (CPS) accounts.\n\n#### CR Details\n##### Scope of Change\nThe scope of this change is limited to the issuance of pink coloured chequebooks to female salary package customers, applying to the Corporate Salary Package under the salary package portfolio. This includes the implementation of gender-based validation in CBS for chequebook requisition and system-level checks to ensure the correct chequebook type issuance.\n\n##### Executive Summary\nThis solution document outlines the proposed changes to the Core Banking System (CBS) to cater to the specific requirement of issuing personalized pink coloured chequebooks to female corporate salary package customers. The changes aim to enhance customer satisfaction, provide a competitive edge in the female customer segment, and align with the bank's diversity and inclusion initiatives.\n\n#### Solution Details\n##### Existing Functionality with Process Flow\nThe current chequebook issuance process in CBS operates without gender-based differentiation. The process involves a customer requesting a chequebook, the teller initiating the cheque requisition in CBS, and the system validating account status and eligibility. However, there is no validation linking the gender code to the chequebook type, leading to potential mismatches in product offerings.\n\n##### Technical Feasibility\nThe proposed solution is technically feasible, as it involves database enhancements and validation logic at multiple checkpoints in the cheque requisition and product code change workflows. The solution requires the creation of a new product code for the pink coloured chequebook, the establishment of a mapping table linking the gender code, product type, and chequebook variant, and updates to the customer tier type validation rules.\n\n##### Proposed Solution Details\nThe proposed solution involves implementing system-level validations in CBS to enable the automatic issuance of pink coloured chequebooks to female customers holding CPS accounts. The solution includes:\n* Database enhancements to capture the gender code and product code mapping\n* Validation logic to check the account product code, customer tier type, and gender code\n* User interface changes to display gender-appropriate chequebook options and show validation error messages\n\n##### Business Acceptance Scenario\nThe business acceptance criteria include:\n* Successful issuance of pink coloured chequebooks to female CPS account holders\n* Validation of account product code, customer tier type, and gender code\n* Error messages displayed for invalid selections\n* Successful integration with existing cheque requisition and product code change workflows\n\n##### Assumptions\nThe assumptions made in this solution include:\n* The functionality will give special recognition to female salary package customers, providing an edge to the bank in this segment\n* The gender code is accurately captured and maintained in the customer master data\n* Female customers in the CPS segment will opt for pink coloured chequebooks\n* The existing chequebook inventory management system can accommodate the new variant\n\n##### Limitations\nThe limitations of this solution include:\n* The solution is limited to the issuance of pink coloured chequebooks to female salary package customers\n* The solution does not address the issuance of chequebooks to male customers or non-salary package account holders\n\n##### User Type or Capability Specifications\nThe user type or capability specifications for this solution include:\n* The teller must have the capability to initiate the cheque requisition in CBS\n* The customer must have a valid CPS account and a captured gender code\n\n##### Maker Checker Specifications\nThe maker checker specifications for this solution include:\n* The teller must verify the account product code, customer tier type, and gender code before issuing the chequebook\n* The system must validate the selections and display error messages for invalid choices\n\n##### Data Migration Applicability\nThe data migration applicability for this solution is not applicable, as the solution does not involve the migration of existing data.\n\n#### System Setup\n##### Parameter Table\nThe parameter table for this solution includes:\n* Product code mapping for CPS accounts\n* Gender code validation rules\n* Chequebook type master with pink variant code\n* Customer tier type validation rules\n\n##### ED1_ED2_ParameterSnapshot\nInformation not provided in source documents.\n\n##### GSTTXNCard\nInformation not provided in source documents.\n\n##### FeeSetup\nInformation not provided in source documents.\n\n#### References\n* Business Requirements Document (BRD) for Personalized Pink Coloured Chequebook for Female Corporate Salary Package Customers\n* Regulatory Document for GDPR Compliance Requirements\n\n#### Document Control\n##### Project Details\n* **Customer:** State Bank of India\n* **Project:** SBI CBS Development\n* **Document Name:** Solution Document for Personalized Pink Coloured Chequebook for Female Corporate Salary Package Customers\n\n##### Version History\n| Version | Date | Description |\n| --- | --- | --- |\n| 1.0 | 28 February 2026 | Initial version of the solution document |\n\n##### SignOff\nInformation not provided in source documents.",
    "CR000002": "### Solution Document\n#### Document Header\n* **Organization:** State Bank of India\n* **Document Title:** Solution Document for Personalized Pink Coloured Chequebook for Female Corporate Salary Package Customers\n* **CR Number:** Information not provided in source documents.\n* **Date:** 28 February 2026\n* **Version:** 1.0\n\n#### Module Information\n* **Module:** NDVP or Module Name: Information not provided in source documents.\n* **Functionality:** Personalized Chequebook Issuance for Female Corporate Salary Package Customers\n* **Brief Description:** The solution aims to implement system-level validations in the Core Banking System (CBS) to enable the automatic issuance of pink coloured chequebooks to female customers holding Corporate Salary Package (CPS) accounts.\n\n#### CR Details\n##### Scope of Change\nThe scope of this change is limited to the issuance of pink coloured chequebooks to female salary package customers under the Corporate Salary Package portfolio. It involves database structure enhancements for gender code validation, CBS validation logic implementation, and system-level checks to ensure correct chequebook type issuance.\n\n##### Executive Summary\nThis solution document outlines the proposed architecture and solution for implementing personalized pink coloured chequebook issuance for female corporate salary package customers. It aligns with the bank's diversity and inclusion initiatives, aiming to enhance customer satisfaction and provide a competitive edge in the female customer segment.\n\n#### Solution Details\n##### Existing Functionality with Process Flow\nThe current chequebook issuance process in CBS operates without gender-based differentiation. The proposed solution introduces system-level validations to automatically issue pink coloured chequebooks to eligible female customers.\n\n##### Technical Feasibility\nThe technical feasibility of the proposed solution involves database enhancements, validation logic additions, and user interface changes. These modifications are expected to be of low to medium complexity.\n\n##### Proposed Solution Details\nThe proposed solution includes:\n1. Database structure enhancements to add a new validation rule based on \"Gender Code\" at the time of cheque requisition for female \"Corporate Salary Package (CPS)\" account holders.\n2. CBS validation logic to perform product code eligibility checks, gender code validation, and chequebook type selection validation.\n3. User interface changes to display gender-appropriate chequebook options, show validation error messages, and provide prompts during product code conversions.\n\n##### Business Acceptance Scenario\nThe business acceptance criteria include successful execution of validation test scenarios, zero critical defects in production, and successful UAT sign-off from business users.\n\n##### Assumptions\nAssumptions include:\n- The functionality will give special recognition to female salary package customers.\n- Gender code is accurately captured and maintained in customer master data.\n- Existing chequebook inventory management system can accommodate the new variant.\n\n##### Limitations\nLimitations include potential errors in issuing appropriate chequebook variants due to manual intervention required for special product offerings.\n\n##### User Type or Capability Specifications\nUser type specifications include teller interface enhancements for gender-appropriate chequebook options and error message displays.\n\n##### Maker Checker Specifications\nMaker Checker specifications are not applicable for this solution.\n\n##### Data Migration Applicability\nData migration is not applicable for this solution.\n\n#### System Setup\n##### Parameter Table\nParameter requirements include:\n- ED1B: Information not provided in source documents.\n- ED2P: Information not provided in source documents.\n- ED3P: Information not provided in source documents.\n- Error Messages: Validation error messages as defined in the proposed solution.\n- DB changes: Database structure enhancements for gender code validation.\n\n#### References\nReferences include the Business Requirement Document (BRD) and the Regulatory Document for GDPR Compliance Requirements.\n\n#### Document Control\n##### Project Details\n* **Customer:** State Bank of India\n* **Project:** SBI CBS Development\n* **Document Name:** Solution Document\n\n##### Version History\nVersion history is not provided in the source documents.\n\n##### Sign Off\nSign-off details are not provided in the source documents."
}