{
    "CR-UNKNOWN-1": "### Solution Document\n#### Document Header\n* **Organization:** State Bank of India\n* **Document Title:** Solution Document for Personalized Pink Coloured Chequebook for Female Corporate Salary Package Customers\n* **CR Number:** Information not provided in source documents.\n* **Date:** 28 February 2026\n* **Version:** 1.0\n\n#### Module Information\n* **Module:** NDVP or Module Name: Information not provided in source documents.\n* **Functionality:** Issuance of Personalized Pink Coloured Chequebook for Female Corporate Salary Package Customers\n* **Brief Description:** The proposed solution aims to implement system-level validations in the Core Banking System (CBS) to enable the automatic issuance of pink coloured chequebooks to female customers holding Corporate Salary Package (CPS) accounts.\n\n#### CR Details\n##### Scope of Change\nThe scope of this change is limited to the issuance of pink coloured chequebooks to female salary package customers, applying to Corporate Salary Package under the salary package portfolio. It includes the implementation of gender-based validation in CBS for chequebook requisition, system-level checks to ensure correct chequebook type issuance, and database structure enhancements for gender code validation.\n\n##### Executive Summary\nThe solution document outlines the proposal for implementing a personalized pink coloured chequebook issuance system for female corporate salary package customers. This change aims to cater to the specific requirement of banks' customized offerings to female salary package customers, enhancing customer satisfaction and providing a competitive advantage in the female customer segment.\n\n#### Solution Details\n##### Existing Functionality with Process Flow\nThe current chequebook issuance process in CBS operates without gender-based differentiation. The teller initiates a cheque requisition in CBS, and the system validates the account status and eligibility. However, there is no validation linking the gender code to the chequebook type, leading to potential mismatches in product offerings targeted at specific customer segments.\n\n##### Technical Feasibility\nThe proposed solution is technically feasible, as it involves database enhancements and validation logic at multiple checkpoints in the cheque requisition and product code change workflows. The solution can be implemented using existing CBS infrastructure and technology.\n\n##### Proposed Solution Details\nThe proposed solution involves the following key components:\n1. **Database Structure Enhancements:** Add a new validation rule based on the \"Gender Code\" at the time of cheque requisition for female \"Corporate Salary Package (CPS)\" account holders.\n2. **CBS Validations:** The Cheque Requisition System will perform product code eligibility checks, gender code validation, and validation logic to ensure the correct issuance of pink coloured chequebooks to eligible customers.\n3. **Validation Logic:** The system will implement validations at two critical junctures: during product code changes and during cheque requisition.\n4. **User Interface Changes:** The teller interface will be enhanced to display gender-appropriate chequebook options, show validation error messages, and provide prompts during product code conversions.\n\n##### Business Acceptance Scenario\nThe business acceptance criteria include the successful issuance of pink coloured chequebooks to eligible female customers, the prevention of incorrect chequebook issuance, and the alignment of account type and chequebook variant.\n\n##### Assumptions\nThe solution assumes that the gender code is accurately captured and maintained in the customer master data, and that the existing chequebook inventory management system can accommodate the new variant.\n\n##### Limitations\nThe solution has no significant technical or business limitations, as it is designed to work within the existing CBS infrastructure and technology.\n\n##### User Type or Capability Specifications\nThe solution does not require any specific user type or capability specifications, as it is designed to work with the existing teller interface and user roles.\n\n##### Maker Checker Specifications\nThe solution does not require any specific maker checker specifications, as it is designed to work with the existing approval and verification processes.\n\n##### Data Migration Applicability\nData migration is not applicable, as the solution involves enhancements to the existing database structure and validation logic.\n\n#### System Setup\n##### Parameter Table\nThe solution requires the following parameter settings:\n* ED1B: Information not provided in source documents.\n* ED2P: Information not provided in source documents.\n* ED3P: Information not provided in source documents.\n* Error Messages: Validation error messages will be displayed to the teller in case of incompatible selections or invalid data.\n* DB changes: The solution requires database structure enhancements to accommodate the new validation rule and mapping tables.\n\n#### References\n* Business Requirements Document (BRD) for Personalized Pink Coloured Chequebook for Female Corporate Salary Package Customers\n* Regulatory Document for GDPR Compliance Requirements\n\n#### Document Control\n##### Project Details\n* **Customer:** State Bank of India\n* **Project:** SBI CBS Development\n* **Document Name:** Solution Document for Personalized Pink Coloured Chequebook for Female Corporate Salary Package Customers\n\n##### Version History\n| Version | Date | Description |\n| --- | --- | --- |\n| 1.0 | 28 February 2026 | Initial version of the solution document |\n\n##### Sign Off\nThe solution document has been prepared by the Quality Assurance Team and is pending approval from the relevant stakeholders.",
    "CR-UNKNOWN-2": "### Solution Document\n#### Document Header\n* **Organization:** State Bank of India\n* **Document Title:** Solution Document for Personalized Pink Coloured Chequebook for Female Corporate Salary Package Customers\n* **CR Number:** Information not provided in source documents.\n* **Date:** 28 February 2026\n* **Version:** 1.0\n\n#### Module Information\n* **Module:** NDVP or Module Name: Information not provided in source documents.\n* **Functionality:** Issuance of Personalized Pink Coloured Chequebook for Female Corporate Salary Package Customers\n* **Brief Description:** The solution aims to implement system-level validations in the Core Banking System (CBS) to enable the automatic issuance of pink coloured chequebooks to female customers holding Corporate Salary Package (CPS) accounts.\n\n#### CR Details\n##### Scope of Change\nThe scope of this change is limited to the issuance of pink coloured chequebooks to female salary package customers, applying to Corporate Salary Package under the salary package portfolio. It includes the implementation of gender-based validation in CBS for chequebook requisition and system-level checks to ensure the correct chequebook type issuance.\n\n##### Executive Summary\nThis solution document outlines the proposal for implementing a system to issue personalized pink coloured chequebooks to female corporate salary package customers. The solution involves database enhancements, validation logic, and user interface changes to ensure that female customers receive the appropriate chequebook type.\n\n#### Solution Details\n##### Existing Functionality with Process Flow\nThe current chequebook issuance process in CBS operates without gender-based differentiation, leading to potential mismatches in product offerings targeted at specific customer segments. The process involves a customer requesting a chequebook, the teller initiating the cheque requisition in CBS, and the system validating account status and eligibility without considering the gender of the account holder.\n\n##### Technical Feasibility\nThe proposed solution is technically feasible as it involves enhancements to the existing database structure and validation logic in the CBS. The solution requires the creation of a new product code for the pink coloured chequebook, the establishment of a mapping table linking gender code, product type, and chequebook variant, and updates to customer tier type validation rules.\n\n##### Proposed Solution Details\nThe proposed solution involves implementing system-level validations in CBS to enable the automatic issuance of pink coloured chequebooks to female customers holding CPS accounts. The solution includes:\n1. Database enhancements to add a new validation rule based on the \"Gender Code\" at the time of cheque requisition for female CPS account holders.\n2. Validation logic to check the product code eligibility, gender code validation, and customer tier type validation.\n3. User interface changes to display gender-appropriate chequebook options during requisition, show validation error messages, and provide prompts during product code conversions.\n\n##### Business Acceptance Scenario\nThe business acceptance criteria include the successful issuance of pink coloured chequebooks to female CPS account holders, the rejection of requests for pink chequebooks from male CPS account holders or non-CPS account holders, and the prompt for new chequebook issuance during product code conversions.\n\n##### Assumptions\nThe solution assumes that the gender code is accurately captured and maintained in the customer master data, female customers in the CPS segment will opt for pink coloured chequebooks, and the existing chequebook inventory management system can accommodate the new variant.\n\n##### Limitations\nThe solution is limited to the issuance of pink coloured chequebooks to female salary package customers and does not address the issuance of chequebooks to male customers or non-salary package account holders.\n\n##### User Type or Capability Specifications\nThe solution requires the teller to have the capability to initiate the cheque requisition process and for the system to validate the gender code and product code eligibility.\n\n##### Maker Checker Specifications\nThe solution does not require maker-checker specifications as it is an automated process.\n\n##### Data Migration Applicability\nData migration is not applicable for this solution as it involves enhancements to the existing database structure and validation logic.\n\n#### System Setup\n##### Parameter Table\nThe parameter table requirements include:\n* ED1B: Information not provided in source documents.\n* ED2P: Information not provided in source documents.\n* ED3P: Information not provided in source documents.\n* Error Messages: Validation error messages will be displayed during the cheque requisition process.\n* DB changes: The solution requires updates to the customer master data, product code mapping table, and chequebook type master.\n\n#### References\n* Regulatory Document: GDPR Compliance Requirements for User Data\n* Business Requirement Document: Personalized Pink Coloured Chequebook for Female Corporate Salary Package Customers\n\n#### Document Control\n##### Project Details\n* **Customer:** State Bank of India\n* **Project:** SBI CBS Development\n* **Document Name:** Solution Document\n\n##### Version History\n| Version | Date | Description |\n| --- | --- | --- |\n| 1.0 | 28 February 2026 | Initial version of the solution document |\n\n##### Sign Off\nThe sign-off details are not provided in the source documents.",
    "CR-UNKNOWN-3": "### Solution Document\n#### Document Header\n* **Organization:** State Bank of India\n* **Document Title:** Solution Document for Personalized Pink Coloured Chequebook for Female Corporate Salary Package Customers\n* **CR Number:** Information not provided in source documents.\n* **Date:** 28 February 2026\n* **Version:** 1.0\n\n#### Module Information\n* **Module:** NDVP or Module Name: Information not provided in source documents.\n* **Functionality:** Issuance of Personalized Pink Coloured Chequebook for Female Corporate Salary Package Customers\n* **Brief Description:** The solution aims to implement system-level validations in the Core Banking System (CBS) to enable the automatic issuance of pink coloured chequebooks to female customers holding Corporate Salary Package (CPS) accounts.\n\n#### CR Details\n##### Scope of Change\nThe scope of this change is limited to the issuance of pink coloured chequebooks to female salary package customers, applying to Corporate Salary Package under the salary package portfolio. It includes the implementation of gender-based validation in CBS for chequebook requisition and system-level checks to ensure the correct chequebook type issuance.\n\n##### Executive Summary\nThis solution document outlines the proposal for implementing a system to issue personalized pink coloured chequebooks to female corporate salary package customers. The solution involves database enhancements, validation logic, and user interface changes to ensure that female customers receive the appropriate chequebook type.\n\n#### Solution Details\n##### Existing Functionality with Process Flow\nThe current chequebook issuance process in CBS operates without gender-based differentiation, leading to potential mismatches in product offerings targeted at specific customer segments. The process involves a customer requesting a chequebook, the teller initiating the cheque requisition in CBS, and the system validating account status and eligibility without considering the gender of the account holder.\n\n##### Technical Feasibility\nThe proposed solution is technically feasible as it involves enhancements to the existing database structure and validation logic in the CBS. The solution requires the creation of a new product code for the pink coloured chequebook, the establishment of a mapping table linking gender code, product type, and chequebook variant, and updates to customer tier type validation rules.\n\n##### Proposed Solution Details\nThe proposed solution involves implementing system-level validations in CBS to enable the automatic issuance of pink coloured chequebooks to female customers holding CPS accounts. The solution includes:\n1. Database enhancements to add a new validation rule based on the \"Gender Code\" at the time of cheque requisition for female CPS account holders.\n2. Validation logic to check the product code eligibility, gender code validation, and customer tier type validation.\n3. User interface changes to display gender-appropriate chequebook options during requisition, show validation error messages, and provide prompts during product code conversions.\n\n##### Business Acceptance Scenario\nThe business acceptance criteria include the successful issuance of pink coloured chequebooks to female CPS account holders, the rejection of requests for pink chequebooks from male CPS account holders or non-CPS account holders, and the prompt for new chequebook issuance during product code conversions.\n\n##### Assumptions\nThe solution assumes that the gender code is accurately captured and maintained in the customer master data, female customers in the CPS segment will opt for pink coloured chequebooks, and the existing chequebook inventory management system can accommodate the new variant.\n\n##### Limitations\nThe solution is limited to the issuance of pink coloured chequebooks to female salary package customers and does not address the issuance of chequebooks to male customers or non-salary package account holders.\n\n##### User Type or Capability Specifications\nThe solution requires the teller to have the capability to initiate the cheque requisition process and for the system to validate the gender code and product code eligibility.\n\n##### Maker Checker Specifications\nThe solution does not require maker-checker specifications as it is an automated process.\n\n##### Data Migration Applicability\nData migration is not applicable for this solution as it involves enhancements to the existing database structure and validation logic.\n\n#### System Setup\n##### Parameter Table\nThe parameter table requirements include:\n* ED1B: Information not provided in source documents.\n* ED2P: Information not provided in source documents.\n* ED3P: Information not provided in source documents.\n* Error Messages: Validation error messages will be displayed during the cheque requisition process.\n* DB changes: The solution requires updates to the customer master data, product code mapping table, and chequebook type master.\n\n#### References\n* Regulatory Document: GDPR Compliance Requirements for User Data\n* Business Requirement Document: Personalized Pink Coloured Chequebook for Female Corporate Salary Package Customers\n\n#### Document Control\n##### Project Details\n* **Customer:** State Bank of India\n* **Project:** SBI CBS Development\n* **Document Name:** Solution Document\n\n##### Version History\n| Version | Date | Description |\n| --- | --- | --- |\n| 1.0 | 28 February 2026 | Initial version of the solution document |\n\n##### Sign Off\nThe sign-off details are not provided in the source documents.\n\nIn terms of GDPR compliance, the solution must ensure that all personally identifiable information (PII) is protected. This includes:\n* **Data Minimization:** Only collect and process data that is strictly necessary for the service.\n* **Right to Access:** Ensure that users can view all personal data stored.\n* **Right to Erasure:** Allow users to delete their account and all associated data within 30 days.\n* **Data Encryption:** Encrypt all PII at rest using AES-256 and in transit using TLS 1.3.\n\nTo address these requirements, the solution will implement the following measures:\n* **Data Minimization:** The solution will only collect and process data that is necessary for the issuance of pink coloured chequebooks to female CPS account holders.\n* **Right to Access:** The solution will provide a mechanism for users to view their personal data stored in the system.\n* **Right to Erasure:** The solution will allow users to delete their account and all associated data within 30 days.\n* **Data Encryption:** The solution will encrypt all PII at rest using AES-256 and in transit using TLS 1.3.\n\nBy implementing these measures, the solution will ensure that it is compliant with the GDPR requirements and protects the personally identifiable information of its users.",
    "CR000001": "### Solution Document\n#### Document Header\n* **Organization:** State Bank of India\n* **Document Title:** Solution Document for Personalized Pink Coloured Chequebook for Female Corporate Salary Package Customers\n* **CR Number:** Information not provided in source documents.\n* **Date:** 28 February 2026\n* **Version:** 1.0\n\n#### Module Information\n* **Module:** NDVP (New Demand Validation Process)\n* **Functionality:** Issuance of Personalized Pink Coloured Chequebook to Female Corporate Salary Package Customers\n* **Brief Description:** The module aims to implement system-level validations in the Core Banking System (CBS) to enable the automatic issuance of pink coloured chequebooks to female customers holding Corporate Salary Package (CPS) accounts.\n\n#### CR Details\n##### Scope of Change\nThe scope of this change is limited to the issuance of pink coloured chequebooks to female salary package customers, applying to the Corporate Salary Package under the salary package portfolio. This includes the implementation of gender-based validation in CBS for chequebook requisition and system-level checks to ensure the correct chequebook type issuance.\n\n##### Executive Summary\nThis solution document outlines the proposed changes to the Core Banking System (CBS) to cater to the specific requirement of issuing personalized pink coloured chequebooks to female corporate salary package customers. The changes aim to enhance customer satisfaction, provide a competitive edge in the female customer segment, and align with the bank's diversity and inclusion initiatives.\n\n#### Solution Details\n##### Existing Functionality with Process Flow\nThe current chequebook issuance process in CBS operates without gender-based differentiation. The process involves a customer requesting a chequebook, the teller initiating the cheque requisition in CBS, and the system validating account status and eligibility. However, there is no validation linking the gender code to the chequebook type, leading to potential mismatches in product offerings.\n\n##### Technical Feasibility\nThe proposed solution is technically feasible, as it involves database enhancements and validation logic at multiple checkpoints in the cheque requisition and product code change workflows. The solution requires the creation of a new product code for the pink coloured chequebook, the establishment of a mapping table linking the gender code, product type, and chequebook variant, and updates to the customer tier type validation rules.\n\n##### Proposed Solution Details\nThe proposed solution involves implementing system-level validations in CBS to enable the automatic issuance of pink coloured chequebooks to female customers holding CPS accounts. The solution includes:\n* Database enhancements to capture the gender code and product code mapping\n* Validation logic to check the account product code, customer tier type, and gender code\n* User interface changes to display gender-appropriate chequebook options and show validation error messages\n\n##### Business Acceptance Scenario\nThe business acceptance criteria include:\n* Successful issuance of pink coloured chequebooks to female CPS account holders\n* Validation of account product code, customer tier type, and gender code\n* Error messages displayed for invalid selections\n* Successful integration with existing cheque requisition and product code change workflows\n\n##### Assumptions\nThe assumptions made in this solution include:\n* The functionality will give special recognition to female salary package customers, providing an edge to the bank in this segment\n* The gender code is accurately captured and maintained in the customer master data\n* Female customers in the CPS segment will opt for pink coloured chequebooks\n* The existing chequebook inventory management system can accommodate the new variant\n\n##### Limitations\nThe limitations of this solution include:\n* The solution is limited to the issuance of pink coloured chequebooks to female salary package customers\n* The solution does not address the issuance of chequebooks to male customers or non-salary package account holders\n\n##### User Type or Capability Specifications\nThe user type or capability specifications for this solution include:\n* The teller must have the capability to initiate the cheque requisition in CBS\n* The customer must have a valid CPS account and a captured gender code\n\n##### Maker Checker Specifications\nThe maker checker specifications for this solution include:\n* The teller must verify the account product code, customer tier type, and gender code before issuing the chequebook\n* The system must validate the selections and display error messages for invalid choices\n\n##### Data Migration Applicability\nThe data migration applicability for this solution is not applicable, as the solution does not involve the migration of existing data.\n\n#### System Setup\n##### Parameter Table\nThe parameter table for this solution includes:\n* Product code mapping for CPS accounts\n* Gender code validation rules\n* Chequebook type master with pink variant code\n* Customer tier type validation rules\n\n##### ED1_ED2_ParameterSnapshot\nInformation not provided in source documents.\n\n##### GSTTXNCard\nInformation not provided in source documents.\n\n##### FeeSetup\nInformation not provided in source documents.\n\n#### References\n* Business Requirements Document (BRD) for Personalized Pink Coloured Chequebook for Female Corporate Salary Package Customers\n* Regulatory Document for GDPR Compliance Requirements\n\n#### Document Control\n##### Project Details\n* **Customer:** State Bank of India\n* **Project:** SBI CBS Development\n* **Document Name:** Solution Document for Personalized Pink Coloured Chequebook for Female Corporate Salary Package Customers\n\n##### Version History\n| Version | Date | Description |\n| --- | --- | --- |\n| 1.0 | 28 February 2026 | Initial version of the solution document |\n\n##### SignOff\nInformation not provided in source documents.",
    "CR000002": "### Solution Document\n#### Document Header\n* **Organization:** State Bank of India\n* **Document Title:** Solution Document for Personalized Pink Coloured Chequebook for Female Corporate Salary Package Customers\n* **CR Number:** Information not provided in source documents.\n* **Date:** 28 February 2026\n* **Version:** 1.0\n\n#### Module Information\n* **Module:** CBS (Core Banking System)\n* **Functionality:** Issuance of Personalized Pink Coloured Chequebook for Female Corporate Salary Package Customers\n* **Brief Description:** The proposed solution aims to implement system-level validations in the CBS to enable the automatic issuance of pink coloured chequebooks to female customers holding Corporate Salary Package (CPS) accounts.\n\n#### CR Details\n##### Scope of Change\nThe scope of this change is limited to the issuance of pink coloured chequebooks to female salary package customers, applying to Corporate Salary Package under the salary package portfolio. This includes database structure enhancements for gender code validation, CBS validation logic implementation, and system-level checks to ensure correct chequebook type issuance.\n\n##### Executive Summary\nThis solution document outlines the proposal for implementing a personalized chequebook issuance system for female corporate salary package customers. The system will automatically issue pink coloured chequebooks to eligible customers, enhancing customer satisfaction and aligning with the bank's diversity and inclusion initiatives.\n\n#### Solution Details\n##### Existing Functionality with Process Flow\nThe current chequebook issuance process in CBS operates without gender-based differentiation, requiring manual intervention for special product offerings. The proposed solution will introduce system-level validations to automatically issue pink coloured chequebooks to female CPS account holders.\n\n##### Technical Feasibility\nThe proposed solution is technically feasible, involving database enhancements and validation logic at multiple checkpoints in the cheque requisition and product code change workflows.\n\n##### Proposed Solution Details\nThe solution involves:\n1. Database enhancements: Adding a new validation rule based on \"Gender Code\" at the time of cheque requisition for female CPS account holders.\n2. Validation logic: Implementing checks for product code eligibility, gender code validation, and ensuring the chosen cheque book type is valid for the gender code.\n3. User interface changes: Enhancing the teller interface to display gender-appropriate chequebook options, show validation error messages, and provide prompts during product code conversions.\n\n##### Business Acceptance Scenario\nThe business acceptance criteria include:\n1. Successful issuance of pink coloured chequebooks to eligible female CPS account holders.\n2. Validation of error messages for incompatible selections.\n3. Confirmation of chequebook type selection.\n\n##### Assumptions\n1. The functionality will give special recognition to female salary package customers.\n2. Gender code is accurately captured and maintained in customer master data.\n3. Female customers in CPS segment will opt for pink coloured chequebooks.\n\n##### Limitations\n1. The solution is limited to salary package accounts and does not apply to non-salary package accounts.\n2. Modifications to male customer chequebook issuance process are out of scope.\n\n##### User Type or Capability Specifications\nThe solution requires teller interface enhancements and role-based access control for overriding validations.\n\n##### Maker Checker Specifications\nNA\n\n##### Data Migration Applicability\nNot applicable\n\n#### System Setup\n##### Parameter Table\nThe solution requires updates to the product code mapping table, chequebook type master, and customer tier type validation rules.\n\n##### ED1_ED2_ParameterSnapshot\nInformation not provided in source documents.\n\n##### GSTTXNCard\nInformation not provided in source documents.\n\n##### FeeSetup\nInformation not provided in source documents.\n\n#### References\n* Business Requirement Document (BRD) for Personalized Pink Coloured Chequebook for Female Corporate Salary Package Customers\n* Regulatory Document for GDPR Compliance Requirements\n\n#### Document Control\n##### Project Details\n* **Customer:** State Bank of India\n* **Project:** SBI CBS Development\n* **Document Name:** Solution Document\n\n##### Version History\n| Version | Date | Description |\n| --- | --- | --- |\n| 1.0 | 28 February 2026 | Initial version |\n\n##### SignOff\nInformation not provided in source documents.",
    "CR000003": "### Solution Document\n#### Document Header\n* **Organization:** State Bank of India\n* **Document Title:** Solution Document for Personalized Pink Coloured Chequebook for Female Corporate Salary Package Customers\n* **CR Number:** Information not provided in source documents.\n* **Date:** 28 February 2026\n* **Version:** 1.0\n\n#### Module Information\n* **Module:** NDVP or Module Name: Information not provided in source documents.\n* **Functionality:** Issuance of Personalized Pink Coloured Chequebook for Female Corporate Salary Package Customers\n* **Brief Description:** The solution aims to implement system-level validations in the Core Banking System (CBS) to enable the automatic issuance of pink coloured chequebooks to female customers holding Corporate Salary Package (CPS) accounts.\n\n#### CR Details\n##### Scope of Change\nThe scope of this change is limited to the issuance of pink coloured chequebooks to female salary package customers, applying to Corporate Salary Package under the salary package portfolio. It includes the implementation of gender-based validation in CBS for chequebook requisition, system-level checks to ensure correct chequebook type issuance, and database structure enhancements for gender code validation.\n\n##### Executive Summary\nThis solution document outlines the proposal for implementing a system to issue personalized pink coloured chequebooks to female corporate salary package customers. The change aims to enhance customer satisfaction, provide a competitive advantage, and align with the bank's diversity and inclusion initiatives.\n\n#### Solution Details\n##### Existing Functionality with Process Flow\nThe current chequebook issuance process in CBS operates without gender-based differentiation. The process involves a customer requesting a chequebook, the teller initiating the cheque requisition in CBS, and the system validating account status and eligibility before issuing a standard chequebook.\n\n##### Technical Feasibility\nThe proposed solution is technically feasible as it involves enhancements to the existing CBS system, including database structure changes and the implementation of validation logic. The solution can be integrated with the existing cheque requisition system, product code change workflow, and chequebook inventory management.\n\n##### Proposed Solution Details\nThe proposed solution involves implementing system-level validations in CBS to enable the automatic issuance of pink coloured chequebooks to female customers holding CPS accounts. This includes:\n- Adding a new validation rule based on \"Gender Code\" at the time of cheque requisition for female CPS account holders.\n- Creating a new product code for the pink coloured chequebook.\n- Establishing a mapping table linking gender code, product type, and chequebook variant.\n- Updating customer tier type validation rules and modifying cheque requisition validation tables.\n\n##### Business Acceptance Scenario\nThe business acceptance criteria include the successful issuance of pink coloured chequebooks to eligible female customers, the prevention of issuance to non-eligible customers, and the integration with existing systems without disrupting current processes.\n\n##### Assumptions\nAssumptions include:\n- The functionality will give special recognition to female salary package customers.\n- Gender code is accurately captured and maintained in customer master data.\n- Female customers in the CPS segment will opt for pink coloured chequebooks.\n- Existing chequebook inventory management system can accommodate the new variant.\n- Branch staff will be adequately trained on the new validation process.\n\n##### Limitations\nThere are no explicitly stated limitations in the provided documents.\n\n##### User Type or Capability Specifications\nUser type specifications include the requirement for tellers to have access to the CBS system and for customers to have a CPS account with a validated gender code.\n\n##### Maker Checker Specifications\nMaker Checker specifications are not explicitly mentioned in the provided documents.\n\n##### Data Migration Applicability\nData migration is not applicable as the solution focuses on enhancing the existing system rather than migrating data from one system to another.\n\n#### System Setup\n##### Parameter Table\nParameter requirements include:\n- ED1B: Information not provided in source documents.\n- ED2P: Information not provided in source documents.\n- ED3P: Information not provided in source documents.\n- Error Messages: Validation error messages will be displayed when incompatible selections are made.\n- DB changes: Database changes are required to accommodate the new validation rules and product codes.\n\n#### References\nReferences include the Business Requirements Document (BRD) for the Personalized Pink Coloured Chequebook for Female Corporate Salary Package Customers and the Regulatory Document outlining GDPR Compliance Requirements for User Data.\n\n#### Document Control\n##### Project Details\n* **Customer:** State Bank of India\n* **Project:** SBI CBS Development\n* **Document Name:** Solution Document\n\n##### Version History\nVersion history is not provided as this is the initial version of the document.\n\n##### Sign Off\nSign-off details are not provided in the source documents."
}